scripts/user_creation/cheongra_websocket_chat_test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="청라1동 WebSocket 채팅 테스트" enabled="true">
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="BASE_URL" elementType="Argument">
            <stringProp name="Argument.name">BASE_URL</stringProp>
            <stringProp name="Argument.value">localhost</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="SERVER_PORT" elementType="Argument">
            <stringProp name="Argument.name">SERVER_PORT</stringProp>
            <stringProp name="Argument.value">8080</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="PROTOCOL" elementType="Argument">
            <stringProp name="Argument.name">PROTOCOL</stringProp>
            <stringProp name="Argument.value">http</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="WS_PROTOCOL" elementType="Argument">
            <stringProp name="Argument.name">WS_PROTOCOL</stringProp>
            <stringProp name="Argument.value">ws</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="CSV_FILE_PATH" elementType="Argument">
            <stringProp name="Argument.name">CSV_FILE_PATH</stringProp>
            <stringProp name="Argument.value">cheongra_users_jmeter.csv</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="CHAT_ROOM_ID" elementType="Argument">
            <stringProp name="Argument.name">CHAT_ROOM_ID</stringProp>
            <stringProp name="Argument.value">1</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="DEFAULT_JWT_TOKEN" elementType="Argument">
            <stringProp name="Argument.name">DEFAULT_JWT_TOKEN</stringProp>
            <stringProp name="Argument.value">eyJhbGciOiJIUzM4NCJ9.eyJzdWIiOiJjNTg1YzI5Mi0yZTAxLTQzOWUtYWM2Zi02MzE0ZTM4NjQ2NjkiLCJlbWFpbCI6ImRwcDNjMTRjQGhvdG1haWwuY29tIiwiaWF0IjoxNzU4NDc3OTk4LCJleHAiOjE3NTg0ODE1OTh9.-sQA7X0YH5MKdl4NSf14bQexRa5GguE7gDqLsu13iJZXyI0ULJaQy3m7-ElquooE</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>
      <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="CSV Data Set Config" enabled="true">
        <stringProp name="filename">cheongra_users_jmeter.csv</stringProp>
        <stringProp name="fileEncoding">UTF-8</stringProp>
        <stringProp name="variableNames">email,password,name,phone,address,detail_address,zonecode,latitude,longitude</stringProp>
        <boolProp name="ignoreFirstLine">true</boolProp>
        <boolProp name="quotedData">false</boolProp>
        <boolProp name="recycle">true</boolProp>
        <boolProp name="stopThread">false</boolProp>
        <stringProp name="shareMode">shareMode.all</stringProp>
        <stringProp name="delimiter">,</stringProp>
      </CSVDataSet>
      <hashTree/>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <intProp name="ThreadGroup.num_threads">3</intProp>
        <intProp name="ThreadGroup.ramp_time">5</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">5</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <!-- 로그인 API 호출 -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="로그인 API" enabled="true">
          <stringProp name="HTTPSampler.domain">${BASE_URL}</stringProp>
          <stringProp name="HTTPSampler.port">${SERVER_PORT}</stringProp>
          <stringProp name="HTTPSampler.protocol">${PROTOCOL}</stringProp>
          <stringProp name="HTTPSampler.path">/api/v1/members/login</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{
  "email": "${email}",
  "password": "${password}"
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="Content-Type" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
              <elementProp name="Accept" elementType="Header">
                <stringProp name="Header.name">Accept</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <!-- JWT 토큰 추출 -->
          <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="JWT 토큰 추출" enabled="true">
            <stringProp name="JSONPostProcessor.referenceNames">jwt_token</stringProp>
            <stringProp name="JSONPostProcessor.jsonPathExpressions">$.data.accessToken</stringProp>
            <stringProp name="JSONPostProcessor.match_numbers">0</stringProp>
            <stringProp name="JSONPostProcessor.defaultValues">eyJhbGciOiJIUzM4NCJ9.eyJzdWIiOiJjNTg1YzI5Mi0yZTAxLTQzOWUtYWM2Zi02MzE0ZTM4NjQ2NjkiLCJlbWFpbCI6ImRwcDNjMTRjQGhvdG1haWwuY29tIiwiaWF0IjoxNzU4NDc3OTk4LCJleHAiOjE3NTg0ODE1OTh9.-sQA7X0YH5MKdl4NSf14bQexRa5GguE7gDqLsu13iJZXyI0ULJaQy3m7-ElquooE</stringProp>
          </JSONPostProcessor>
          <hashTree/>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="로그인 성공 확인" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">"success":true</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">2</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>

        <!-- WebSocket 연결 설정 -->
        <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="WebSocket 연결 설정" enabled="true">
          <stringProp name="HTTPSampler.domain">${BASE_URL}</stringProp>
          <stringProp name="HTTPSampler.port">${SERVER_PORT}</stringProp>
          <stringProp name="HTTPSampler.protocol">${WS_PROTOCOL}</stringProp>
          <stringProp name="HTTPSampler.path">/ws/chat</stringProp>
        </ConfigTestElement>
        <hashTree/>

        <!-- WebSocket 채팅방 입장 -->
        <net.xeustechnologies.jmeter.samplers.WebSocketSampler guiclass="net.xeustechnologies.jmeter.samplers.WebSocketSamplerGui" testclass="net.xeustechnologies.jmeter.samplers.WebSocketSampler" testname="WebSocket 채팅방 입장" enabled="true">
          <stringProp name="WebSocketSampler.requestData">{
  "type": "ENTER",
  "roomId": "${CHAT_ROOM_ID}",
  "sender": "${name}",
  "message": "채팅방에 입장했습니다"
}</stringProp>
          <stringProp name="WebSocketSampler.connectTimeOut">5000</stringProp>
          <stringProp name="WebSocketSampler.responseTimeOut">10000</stringProp>
          <boolProp name="WebSocketSampler.readResponse">true</boolProp>
          <stringProp name="WebSocketSampler.implementation">native</stringProp>
          <stringProp name="WebSocketSampler.server">ws://${BASE_URL}:${SERVER_PORT}/ws/chat</stringProp>
          <stringProp name="WebSocketSampler.port">${SERVER_PORT}</stringProp>
          <stringProp name="WebSocketSampler.path">/ws/chat</stringProp>
          <stringProp name="WebSocketSampler.protocol">${WS_PROTOCOL}</stringProp>
          <stringProp name="WebSocketSampler.connectionId">chat_connection_${__threadNum}</stringProp>
        </net.xeustechnologies.jmeter.samplers.WebSocketSampler>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="WebSocket 인증 헤더" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="Authorization" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">Bearer ${jwt_token}</stringProp>
              </elementProp>
              <elementProp name="Sec-WebSocket-Protocol" elementType="Header">
                <stringProp name="Header.name">Sec-WebSocket-Protocol</stringProp>
                <stringProp name="Header.value">authorization</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="채팅방 입장 확인" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49587">ENTER</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">2</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>

        <!-- 메시지 전송 테스트 -->
        <net.xeustechnologies.jmeter.samplers.WebSocketSampler guiclass="net.xeustechnologies.jmeter.samplers.WebSocketSamplerGui" testclass="net.xeustechnologies.jmeter.samplers.WebSocketSampler" testname="WebSocket 메시지 전송" enabled="true">
          <stringProp name="WebSocketSampler.requestData">{
  "type": "TALK",
  "roomId": "${CHAT_ROOM_ID}",
  "sender": "${name}",
  "message": "안녕하세요! 테스트 메시지입니다."
}</stringProp>
          <stringProp name="WebSocketSampler.connectTimeOut">5000</stringProp>
          <stringProp name="WebSocketSampler.responseTimeOut">10000</stringProp>
          <boolProp name="WebSocketSampler.readResponse">true</boolProp>
          <stringProp name="WebSocketSampler.implementation">native</stringProp>
          <stringProp name="WebSocketSampler.server">ws://${BASE_URL}:${SERVER_PORT}/ws/chat</stringProp>
          <stringProp name="WebSocketSampler.port">${SERVER_PORT}</stringProp>
          <stringProp name="WebSocketSampler.path">/ws/chat</stringProp>
          <stringProp name="WebSocketSampler.protocol">${WS_PROTOCOL}</stringProp>
          <stringProp name="WebSocketSampler.connectionId">chat_connection_${__threadNum}</stringProp>
        </net.xeustechnologies.jmeter.samplers.WebSocketSampler>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="메시지 전송 확인" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49588">TALK</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">2</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>

        <!-- View Results Tree -->
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>